reports/local/browser-screenshot-test/k6-summary-2025-11-28_10-19-43-060Z.txt


  █ THRESHOLDS 

    checks
    ✓ 'rate==1.0' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 0     0/s
    checks_succeeded...................: 0.00% 0 out of 0
    checks_failed......................: NaN%  0 out of 0


    EXECUTION
    iteration_duration...................................: min=33611.82ms avg=33611.82ms med=33611.82ms max=33611.82ms p(90)=33611.82ms p(95)=33611.82ms p(99)=33611.82ms p(99.9)=33611.82ms
    iterations...........................................: 1     0.02547/s
    vus..................................................: 1     min=1      max=1
    vus_max..............................................: 1     min=1      max=1

    NETWORK
    data_received........................................: 0 B   0 B/s
    data_sent............................................: 0 B   0 B/s

    BROWSER
    browser_data_received................................: 22 kB 561 B/s
    browser_data_sent....................................: 871 B 22 B/s
    browser_http_req_duration............................: min=105.08ms   avg=438.06ms   med=173.36ms   max=1035.73ms  p(90)=863.25ms   p(95)=949.49ms   p(99)=1018.48ms  p(99.9)=1034.00ms 
    browser_http_req_failed..............................: 0.00% 0 out of 3

    WEB_VITALS
    browser_web_vital_fcp................................: min=1644.00ms  avg=1644.00ms  med=1644.00ms  max=1644.00ms  p(90)=1644.00ms  p(95)=1644.00ms  p(99)=1644.00ms  p(99.9)=1644.00ms 
    browser_web_vital_ttfb...............................: min=1143.50ms  avg=1143.50ms  med=1143.50ms  max=1143.50ms  p(90)=1143.50ms  p(95)=1143.50ms  p(99)=1143.50ms  p(99.9)=1143.50ms 


  █ SCENARIO: browser 

    EXECUTION
    iteration_duration...................................: min=33611.82ms avg=33611.82ms med=33611.82ms max=33611.82ms p(90)=33611.82ms p(95)=33611.82ms p(99)=33611.82ms p(99.9)=33611.82ms
    iterations...........................................: 1     0.02547/s

    NETWORK
    data_received........................................: 0 B   0 B/s
    data_sent............................................: 0 B   0 B/s

    BROWSER
    browser_data_received................................: 22 kB 561 B/s
    browser_data_sent....................................: 871 B 22 B/s
    browser_http_req_duration............................: min=105.08ms   avg=438.06ms   med=173.36ms   max=1035.73ms  p(90)=863.25ms   p(95)=949.49ms   p(99)=1018.48ms  p(99.9)=1034.00ms 
    browser_http_req_failed..............................: 0.00% 0 out of 3

    WEB_VITALS
    browser_web_vital_fcp................................: min=1644.00ms  avg=1644.00ms  med=1644.00ms  max=1644.00ms  p(90)=1644.00ms  p(95)=1644.00ms  p(99)=1644.00ms  p(99.9)=1644.00ms 
    browser_web_vital_ttfb...............................: min=1143.50ms  avg=1143.50ms  med=1143.50ms  max=1143.50ms  p(90)=1143.50ms  p(95)=1143.50ms  p(99)=1143.50ms  p(99.9)=1143.50ms 



running (00m39.3s), 0/1 VUs, 1 complete and 0 interrupted iterations
browser ✓ [ 100% ] 1 VUs  00m39.3s/10m0s  1/1 shared iters